MorgothCreator/mSdk/SDK/platform/stm32f7xx/sys/Include/core_cm7.h
#define xPSR_C_Pos                         29U                                            /*!< xPSR: C Position */
#define xPSR_C_Msk                         (1UL << xPSR_C_Pos)                            /*!< xPSR: C Mask */

#define xPSR_V_Pos                         28U                                            /*!< xPSR: V Position */
#define xPSR_V_Msk                         (1UL << xPSR_V_Pos)                            /*!< xPSR: V Mask */

#define xPSR_Q_Pos                         27U                                            /*!< xPSR: Q Position */
#define xPSR_Q_Msk                         (1UL << xPSR_Q_Pos)                            /*!< xPSR: Q Mask */

#define xPSR_IT_Pos                        25U                                            /*!< xPSR: IT Position */
#define xPSR_IT_Msk                        (3UL << xPSR_IT_Pos)                           /*!< xPSR: IT Mask */

#define xPSR_T_Pos                         24U                                            /*!< xPSR: T Position */
#define xPSR_T_Msk                         (1UL << xPSR_T_Pos)                            /*!< xPSR: T Mask */

#define xPSR_GE_Pos                        16U                                            /*!< xPSR: GE Position */
#define xPSR_GE_Msk                        (0xFUL << xPSR_GE_Pos)                         /*!< xPSR: GE Mask */

#define xPSR_ISR_Pos                        0U                                            /*!< xPSR: ISR Position */
#define xPSR_ISR_Msk                       (0x1FFUL /*<< xPSR_ISR_Pos*/)                  /*!< xPSR: ISR Mask */


/**
  \brief  Union type to access the Control Registers (CONTROL).
 */
typedef union
{
  struct
  {
    unsigned long nPRIV:1;                    /*!< bit:      0  Execution privilege in Thread mode */
    unsigned long SPSEL:1;                    /*!< bit:      1  Stack to be used */
    unsigned long FPCA:1;                     /*!< bit:      2  FP extension active flag */
    unsigned long _reserved0:29;              /*!< bit:  3..31  Reserved */
  } b;                                   /*!< Structure used for bit  access */
  unsigned long w;                            /*!< Type      used for word access */
} CONTROL_Type;

/* CONTROL Register Definitions */
#define CONTROL_FPCA_Pos                    2U                                            /*!< CONTROL: FPCA Position */
#define CONTROL_FPCA_Msk                   (1UL << CONTROL_FPCA_Pos)                      /*!< CONTROL: FPCA Mask */

#define CONTROL_SPSEL_Pos                   1U                                            /*!< CONTROL: SPSEL Position */
#define CONTROL_SPSEL_Msk                  (1UL << CONTROL_SPSEL_Pos)                     /*!< CONTROL: SPSEL Mask */

#define CONTROL_nPRIV_Pos                   0U                                            /*!< CONTROL: nPRIV Position */
#define CONTROL_nPRIV_Msk                  (1UL /*<< CONTROL_nPRIV_Pos*/)                 /*!< CONTROL: nPRIV Mask */

/*@} end of group CMSIS_CORE */


/**
  \ingroup    CMSIS_core_register
  \defgroup   CMSIS_NVIC  Nested Vectored Interrupt Controller (NVIC)
  \brief      Type definitions for the NVIC Registers
  @{
 */

/**
  \brief  Structure type to access the Nested Vectored Interrupt Controller (NVIC).
 */
typedef struct
{
  volatile unsigned long ISER[8U];               /*!< Offset: 0x000 (R/W)  Interrupt Set Enable Register */
        unsigned long RESERVED0[24U];
  volatile unsigned long ICER[8U];               /*!< Offset: 0x080 (R/W)  Interrupt Clear Enable Register */
        unsigned long RSERVED1[24U];
  volatile unsigned long ISPR[8U];               /*!< Offset: 0x100 (R/W)  Interrupt Set Pending Register */
        unsigned long RESERVED2[24U];
  volatile unsigned long ICPR[8U];               /*!< Offset: 0x180 (R/W)  Interrupt Clear Pending Register */
        unsigned long RESERVED3[24U];
  volatile unsigned long IABR[8U];               /*!< Offset: 0x200 (R/W)  Interrupt Active bit Register */
        unsigned long RESERVED4[56U];
  volatile unsigned char  IP[240U];               /*!< Offset: 0x300 (R/W)  Interrupt Priority Register (8Bit wide) */
        unsigned long RESERVED5[644U];
  volatile  unsigned long STIR;                   /*!< Offset: 0xE00 ( /W)  Software Trigger Interrupt Register */
}  NVIC_Type;

/* Software Triggered Interrupt Register Definitions */
#define NVIC_STIR_INTID_Pos                 0U                                         /*!< STIR: INTLINESNUM Position */
#define NVIC_STIR_INTID_Msk                (0x1FFUL /*<< NVIC_STIR_INTID_Pos*/)        /*!< STIR: INTLINESNUM Mask */

/*@} end of group CMSIS_NVIC */


/**
  \ingroup  CMSIS_core_register
  \defgroup CMSIS_SCB     System Control Block (SCB)
  \brief    Type definitions for the System Control Block Registers
  @{
 */

/**
  \brief  Structure type to access the System Control Block (SCB).
 */
typedef struct
{
  volatile const  unsigned long CPUID;                  /*!< Offset: 0x000 (R/ )  CPUID Base Register */
  volatile unsigned long ICSR;                   /*!< Offset: 0x004 (R/W)  Interrupt Control and State Register */
  volatile unsigned long VTOR;                   /*!< Offset: 0x008 (R/W)  Vector Table Offset Register */
  volatile unsigned long AIRCR;                  /*!< Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register */
  volatile unsigned long SCR;                    /*!< Offset: 0x010 (R/W)  System Control Register */
  volatile unsigned long CCR;                    /*!< Offset: 0x014 (R/W)  Configuration Control Register */
  volatile unsigned char  SHPR[12U];              /*!< Offset: 0x018 (R/W)  System Handlers Priority Registers (4-7, 8-11, 12-15) */
  volatile unsigned long SHCSR;                  /*!< Offset: 0x024 (R/W)  System Handler Control and State Register */
  volatile unsigned long CFSR;                   /*!< Offset: 0x028 (R/W)  Configurable Fault Status Register */
  volatile unsigned long HFSR;                   /*!< Offset: 0x02C (R/W)  HardFault Status Register */
  volatile unsigned long DFSR;                   /*!< Offset: 0x030 (R/W)  Debug Fault Status Register */
  volatile unsigned long MMFAR;                  /*!< Offset: 0x034 (R/W)  MemManage Fault Address Register */
  volatile unsigned long BFAR;                   /*!< Offset: 0x038 (R/W)  BusFault Address Register */
  volatile unsigned long AFSR;                   /*!< Offset: 0x03C (R/W)  Auxiliary Fault Status Register */
  volatile const  unsigned long ID_PFR[2U];             /*!< Offset: 0x040 (R/ )  Processor Feature Register */
  volatile const  unsigned long ID_DFR;                 /*!< Offset: 0x048 (R/ )  Debug Feature Register */
  volatile const  unsigned long ID_AFR;                 /*!< Offset: 0x04C (R/ )  Auxiliary Feature Register */
  volatile const  unsigned long ID_MFR[4U];             /*!< Offset: 0x050 (R/ )  Memory Model Feature Register */
  volatile const  unsigned long ID_ISAR[5U];            /*!< Offset: 0x060 (R/ )  Instruction Set Attributes Register */
        unsigned long RESERVED0[1U];
  volatile const  unsigned long CLIDR;                  /*!< Offset: 0x078 (R/ )  Cache Level ID register */
  volatile const  unsigned long CTR;                    /*!< Offset: 0x07C (R/ )  Cache Type register */
  volatile const  unsigned long CCSIDR;                 /*!< Offset: 0x080 (R/ )  Cache Size ID Register */
  volatile unsigned long CSSELR;                 /*!< Offset: 0x084 (R/W)  Cache Size Selection Register */
  volatile unsigned long CPACR;                  /*!< Offset: 0x088 (R/W)  Coprocessor Access Control Register */
        unsigned long RESERVED3[93U];
  volatile  unsigned long STIR;                   /*!< Offset: 0x200 ( /W)  Software Triggered Interrupt Register */
        unsigned long RESERVED4[15U];
  volatile const  unsigned long MVFR0;                  /*!< Offset: 0x240 (R/ )  Media and VFP Feature Register 0 */
  volatile const  unsigned long MVFR1;                  /*!< Offset: 0x244 (R/ )  Media and VFP Feature Register 1 */
  volatile const  unsigned long MVFR2;                  /*!< Offset: 0x248 (R/ )  Media and VFP Feature Register 1 */
        unsigned long RESERVED5[1U];
  volatile  unsigned long ICIALLU;                /*!< Offset: 0x250 ( /W)  I-Cache Invalidate All to PoU */
        unsigned long RESERVED6[1U];
  volatile  unsigned long ICIMVAU;                /*!< Offset: 0x258 ( /W)  I-Cache Invalidate by MVA to PoU */
  volatile  unsigned long DCIMVAC;                /*!< Offset: 0x25C ( /W)  D-Cache Invalidate by MVA to PoC */
  volatile  unsigned long DCISW;                  /*!< Offset: 0x260 ( /W)  D-Cache Invalidate by Set-way */
  volatile  unsigned long DCCMVAU;                /*!< Offset: 0x264 ( /W)  D-Cache Clean by MVA to PoU */
  volatile  unsigned long DCCMVAC;                /*!< Offset: 0x268 ( /W)  D-Cache Clean by MVA to PoC */
  volatile  unsigned long DCCSW;                  /*!< Offset: 0x26C ( /W)  D-Cache Clean by Set-way */
  volatile  unsigned long DCCIMVAC;               /*!< Offset: 0x270 ( /W)  D-Cache Clean and Invalidate by MVA to PoC */
  volatile  unsigned long DCCISW;                 /*!< Offset: 0x274 ( /W)  D-Cache Clean and Invalidate by Set-way */
        unsigned long RESERVED7[6U];
  volatile unsigned long ITCMCR;                 /*!< Offset: 0x290 (R/W)  Instruction Tightly-Coupled Memory Control Register */
  volatile unsigned long DTCMCR;                 /*!< Offset: 0x294 (R/W)  Data Tightly-Coupled Memory Control Registers */
  volatile unsigned long AHBPCR;                 /*!< Offset: 0x298 (R/W)  AHBP Control Register */
  volatile unsigned long CACR;                   /*!< Offset: 0x29C (R/W)  L1 Cache Control Register */
  volatile unsigned long AHBSCR;                 /*!< Offset: 0x2A0 (R/W)  AHB Slave Control Register */
        unsigned long RESERVED8[1U];
  volatile unsigned long ABFSR;                  /*!< Offset: 0x2A8 (R/W)  Auxiliary Bus Fault Status Register */
} SCB_Type;

/* SCB CPUID Register Definitions */
#define SCB_CPUID_IMPLEMENTER_Pos          24U                                            /*!< SCB CPUID: IMPLEMENTER Position */
#define SCB_CPUID_IMPLEMENTER_Msk          (0xFFUL << SCB_CPUID_IMPLEMENTER_Pos)          /*!< SCB CPUID: IMPLEMENTER Mask */

#define SCB_CPUID_VARIANT_Pos              20U                                            /*!< SCB CPUID: VARIANT Position */
#define SCB_CPUID_VARIANT_Msk              (0xFUL << SCB_CPUID_VARIANT_Pos)               /*!< SCB CPUID: VARIANT Mask */

