MorgothCreator/mSdk/SDK/platform/stm32f7xx/sys/Include/core_cm7.h
  for(;;)                                                           /* wait until reset */
  {
	  __ASM volatile ("nop");
  }
}

/*@} end of CMSIS_Core_NVICFunctions */


/* ##########################  FPU functions  #################################### */
/**
  \ingroup  CMSIS_Core_FunctionInterface
  \defgroup CMSIS_Core_FpuFunctions FPU Functions
  \brief    Function that provides FPU type.
  @{
 */

/**
  \brief   get FPU type
  \details returns the FPU type
  \returns
   - \b  0: No FPU
   - \b  1: Single precision FPU
   - \b  2: Double + Single precision FPU
 */
__STATIC_INLINE unsigned long SCB_GetFPUType(void)
{
  unsigned long mvfr0;

  mvfr0 = SCB->MVFR0;
  if        ((mvfr0 & 0x00000FF0UL) == 0x220UL)
  {
    return 2UL;           /* Double + Single precision FPU */
  }
  else if ((mvfr0 & 0x00000FF0UL) == 0x020UL)
  {
    return 1UL;           /* Single precision FPU */
  }
  else
  {
    return 0UL;           /* No FPU */
  }
}


/*@} end of CMSIS_Core_FpuFunctions */



/* ##########################  Cache functions  #################################### */
/**
  \ingroup  CMSIS_Core_FunctionInterface
  \defgroup CMSIS_Core_CacheFunctions Cache Functions
  \brief    Functions that configure Instruction and Data cache.
  @{
 */

/* Cache Size ID Register Macros */
#define CCSIDR_WAYS(x)         (((x) & SCB_CCSIDR_ASSOCIATIVITY_Msk) >> SCB_CCSIDR_ASSOCIATIVITY_Pos)
#define CCSIDR_SETS(x)         (((x) & SCB_CCSIDR_NUMSETS_Msk      ) >> SCB_CCSIDR_NUMSETS_Pos      )


/**
  \brief   Enable I-Cache
  \details Turns on I-Cache
  */
__STATIC_INLINE void SCB_EnableICache (void)
{
  #if (__ICACHE_PRESENT == 1U)
	__ASM volatile ("dsb 0xF":::"memory");
	__ASM volatile ("isb 0xF":::"memory");
    SCB->ICIALLU = 0UL;                     /* invalidate I-Cache */
    SCB->CCR |=  (unsigned long)SCB_CCR_IC_Msk;  /* enable I-Cache */
    __ASM volatile ("dsb 0xF":::"memory");
    __ASM volatile ("isb 0xF":::"memory");
  #endif
}


/**
  \brief   Disable I-Cache
  \details Turns off I-Cache
  */
__STATIC_INLINE void SCB_DisableICache (void)
{
  #if (__ICACHE_PRESENT == 1U)
	__ASM volatile ("dsb 0xF":::"memory");
    __ASM volatile ("isb 0xF":::"memory");
    SCB->CCR &= ~(unsigned long)SCB_CCR_IC_Msk;  /* disable I-Cache */
    SCB->ICIALLU = 0UL;                     /* invalidate I-Cache */
    __ASM volatile ("dsb 0xF":::"memory");
    __ASM volatile ("isb 0xF":::"memory");
  #endif
}


/**
  \brief   Invalidate I-Cache
  \details Invalidates I-Cache
  */
__STATIC_INLINE void SCB_InvalidateICache (void)
{
  #if (__ICACHE_PRESENT == 1U)
	__ASM volatile ("dsb 0xF":::"memory");
    __ASM volatile ("isb 0xF":::"memory");
    SCB->ICIALLU = 0UL;
    __ASM volatile ("dsb 0xF":::"memory");
    __ASM volatile ("isb 0xF":::"memory");
  #endif
}


/**
  \brief   Enable D-Cache
  \details Turns on D-Cache
  */
__STATIC_INLINE void SCB_EnableDCache (void)
{
  #if (__DCACHE_PRESENT == 1U)
    unsigned long ccsidr;
    unsigned long sets;
    unsigned long ways;

    SCB->CSSELR = (0U << 1U) | 0U;          /* Level 1 data cache */
    __ASM volatile ("dsb 0xF":::"memory");

    ccsidr = SCB->CCSIDR;

                                            /* invalidate D-Cache */
    sets = (unsigned long)(CCSIDR_SETS(ccsidr));
    do {
      ways = (unsigned long)(CCSIDR_WAYS(ccsidr));
      do {
        SCB->DCISW = (((sets << SCB_DCISW_SET_Pos) & SCB_DCISW_SET_Msk) |
                      ((ways << SCB_DCISW_WAY_Pos) & SCB_DCISW_WAY_Msk)  );
        #if defined ( __CC_ARM )
          __schedule_barrier();
        #endif
      } while (ways--);
    } while(sets--);
    __ASM volatile ("dsb 0xF":::"memory");

    SCB->CCR |=  (unsigned long)SCB_CCR_DC_Msk;  /* enable D-Cache */

    __ASM volatile ("dsb 0xF":::"memory");
    __ASM volatile ("isb 0xF":::"memory");
  #endif
}


/**
  \brief   Disable D-Cache
  \details Turns off D-Cache
  */
__STATIC_INLINE void SCB_DisableDCache (void)
{
  #if (__DCACHE_PRESENT == 1U)
    unsigned long ccsidr;
    unsigned long sets;
    unsigned long ways;

    SCB->CSSELR = (0U << 1U) | 0U;          /* Level 1 data cache */
    __ASM volatile ("dsb 0xF":::"memory");

    ccsidr = SCB->CCSIDR;

    SCB->CCR &= ~(unsigned long)SCB_CCR_DC_Msk;  /* disable D-Cache */

                                            /* clean & invalidate D-Cache */
    sets = (unsigned long)(CCSIDR_SETS(ccsidr));
    do {
      ways = (unsigned long)(CCSIDR_WAYS(ccsidr));
      do {
        SCB->DCCISW = (((sets << SCB_DCCISW_SET_Pos) & SCB_DCCISW_SET_Msk) |
                       ((ways << SCB_DCCISW_WAY_Pos) & SCB_DCCISW_WAY_Msk)  );
        #if defined ( __CC_ARM )
          __schedule_barrier();
        #endif
      } while (ways--);
    } while(sets--);

    __ASM volatile ("dsb 0xF":::"memory");
    __ASM volatile ("isb 0xF":::"memory");
  #endif
}


/**
  \brief   Invalidate D-Cache
  \details Invalidates D-Cache
  */
__STATIC_INLINE void SCB_InvalidateDCache (void)
{
  #if (__DCACHE_PRESENT == 1U)
    unsigned long ccsidr;
    unsigned long sets;
    unsigned long ways;

    SCB->CSSELR = (0U << 1U) | 0U;          /* Level 1 data cache */
    __ASM volatile ("dsb 0xF":::"memory");

    ccsidr = SCB->CCSIDR;

                                            /* invalidate D-Cache */
    sets = (unsigned long)(CCSIDR_SETS(ccsidr));
    do {
      ways = (unsigned long)(CCSIDR_WAYS(ccsidr));
      do {
        SCB->DCISW = (((sets << SCB_DCISW_SET_Pos) & SCB_DCISW_SET_Msk) |
                      ((ways << SCB_DCISW_WAY_Pos) & SCB_DCISW_WAY_Msk)  );
        #if defined ( __CC_ARM )
          __schedule_barrier();
        #endif
      } while (ways--);
    } while(sets--);

    __ASM volatile ("dsb 0xF":::"memory");
    __ASM volatile ("isb 0xF":::"memory");
  #endif
}


/**
  \brief   Clean D-Cache
  \details Cleans D-Cache
  */
__STATIC_INLINE void SCB_CleanDCache (void)
{
  #if (__DCACHE_PRESENT == 1U)
    unsigned long ccsidr;
    unsigned long sets;
    unsigned long ways;

    SCB->CSSELR = (0U << 1U) | 0U;          /* Level 1 data cache */
    __ASM volatile ("dsb 0xF":::"memory");

    ccsidr = SCB->CCSIDR;

                                            /* clean D-Cache */
    sets = (unsigned long)(CCSIDR_SETS(ccsidr));
    do {
      ways = (unsigned long)(CCSIDR_WAYS(ccsidr));
      do {
        SCB->DCCSW = (((sets << SCB_DCCSW_SET_Pos) & SCB_DCCSW_SET_Msk) |
                      ((ways << SCB_DCCSW_WAY_Pos) & SCB_DCCSW_WAY_Msk)  );
        #if defined ( __CC_ARM )
          __schedule_barrier();
        #endif
      } while (ways--);
    } while(sets--);

    __ASM volatile ("dsb 0xF":::"memory");
    __ASM volatile ("isb 0xF":::"memory");
  #endif
}


/**
  \brief   Clean & Invalidate D-Cache
  \details Cleans and Invalidates D-Cache
  */
__STATIC_INLINE void SCB_CleanInvalidateDCache (void)
{
  #if (__DCACHE_PRESENT == 1U)
    unsigned long ccsidr;
    unsigned long sets;
    unsigned long ways;

